---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorCannotAddDirectionCurve
source: html/a155676b-5421-0229-218b-a9917217ac49.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorCannotAddDirectionCurve Property

Cannot add the direction curve in the floor sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId FloorCannotAddDirectionCurve { get; }
```